#Пользователь вводит предложение, заменить все пробелы на "-" 2-мя
#способами
sentence = input('Введите предложение: ')
print(sentence.split())
