# Без использования collections, написать программу, которая будет
# создавать словарь для подсчитывания количества вхождений каждой
# буквы в текст введенный с клавиатуры
words = input('Введите n степеней: ')
# words1 = [input('Введите: ') for i in range(words)]
count_lettes =
print(*words)

