#Дан список чисел, необходимо его развернуть без использования метода revese и
# функции reversed, а так же дополнительного списка и среза

def reverse_lst(lst):
    for i in range(lst:
        lst.append(lst.pop(0))
        print(lst)

numbers = [1, 2, 3, 4, 5]
reverse_lst(numbers)